WcfHarness/WcfHarness/RequestXmls/ManageUserRoles.xml

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <ManageUserRoles xmlns="http://www.tavisca.com/Vexiere/IUser/2013/01">
      <manageUserRolesRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:OperationMode>AppendMode</a:OperationMode>
        <a:RoleIdentifiers>
          <a:RoleIdentifier i:type="a:IdBasedRoleIdentifier">
            <a:Id>1</a:Id>
          </a:RoleIdentifier>
        </a:RoleIdentifiers>
        <a:UserIdentifier i:type="a:IdBasedUserIdentifier">
          <a:Id>1</a:Id>
        </a:UserIdentifier>
      </manageUserRolesRequest>
    </ManageUserRoles>
  </s:Body>
</s:Envelope>